#-------------------------------------------------------------------------------------------------
# Функция type() возвращает тип данных объекта (его класс)
print(type('abcde'))

#-------------------------------------------------------------------------------------------------
# Создание класса. Объекты и атрибуты.
# создаём класс, который будет моделировать животных
class Animal:
    pass  # пока никаких методов и атрибутов нет

# создаём двух конкретных животных (экземпляры класса Animal)
a = Animal()
b = Animal()

# создаём атрибуты для объектов-животных
a.name = 'cat'
a.color = 'black'
b.name = 'fox'
b.color = 'orange'

print(a.name, a.color)  # => cat black
print(b.name, b.color)  # => fox orange

# попробуем вывести несуществующий атрибут
print(a.age)  # => AttributeError: 'Animal' object has no attribute 'age'

#-------------------------------------------------------------------------------------------------
# Методы класса. Создадим класс для приветствия
class Greeting():

    # создаём метод для вывода 'Hello!' на экран (здесь self - некоторый объект класса)
    def hello(self):
        print('Hello!')


mssg = Greeting()
mssg.hello()  # => выведется сообщение 'Hello!'

#-------------------------------------------------------------------------------------------------
# Создадим класс, моделирующий поведение автомобилей

class Car():

    # создадим метод, который заводит машину
    def start(self):
        engine_on = True  # Обратите внимание, переменная локальная!
        # True - машина заведена, False - машина не заведена

    # создадим метод, который отправляет автомобиль в какой-либо город city
    def drive_to(self, city):
        if engine_on:
            print(f'Вперёд! Едем в город {city}.')
        else:
            print('Машина не заведена. Никуда не едем.')


bmw = Car()
bmw.start()
bmw.drive_to('Санкт-Петербург')    # => NameError: name 'engine_on' is not defined

# Ошибка возникла, так как переменная engine_on - локальная, она создана внутри start()
# и видно её только внутри этой функции. Хотелось бы, чтобы атрибуты класса были доступны
# во всех его методах. Это можно сделать, указав перед названием атрибута контекстный объект self

# Исправим ошибку:
class Car():

    # создадим метод, который заводит машину
    def start(self):
        self.engine_on = True  # сохранили атрибут внутри self

    # создадим метод, который отправляет автомобиль в какой-либо город city
    def drive_to(self, city):
        if self.engine_on:  # Теперь переменную здесь видно, т.к. она привязана к объекту self
            print(f'Вперёд! Едем в город {city}.')
        else:
            print('Машина не заведена. Никуда не едем.')


bmw = Car()
bmw.start()
bmw.drive_to('Санкт-Петербург')  # => Вперёд! Едем в город Санкт-Петербург

#-------------------------------------------------------------------------------------------------
# У переменной engine_on сейчас нет начального значения. Если мы не заведём машину и
# сразу применим метод drive_to(), то программа выведет ошибку:
# AttributeError: 'Car' object has no attribute 'engine_on'
# То есть атрибут ещё не создан, а мы уже выполняем проверку. Чтобы ошибки не возникало,
# нужно при создании каждого объекта Car() сразу задавать начальное значение
# engine_on = False (изначально машина не заведена).
# Для этого есть специальный метод __init__(), который вызывается автоматически при создании объекта,
# то есть нам не нужно прописывать вызов в основной части программы. Туда же можно передавать атрибуты,
# которые будут указываться сразу при создании объекта. Добавим __init__() в наш класс:

class Car():
    # этот метод автоматически сработает и каждая машина Car() изначально не будет заведена
    # а также при создании мы теперь будем задавать цвет машины color
    def __init__(self, color):
        self.engine_on = False
        self.color = color


    def start(self):
        self.engine_on = True  # сохранили атрибут внутри self


    # геттер - метод для получения значения цвета
    def get_color(self):
        return self.color


    def drive_to(self, city):
        if self.engine_on:
            print(f'Вперёд! Едем в город {city}.')
        else:
            print('Машина не заведена. Никуда не едем.')


bmw = Car('серебристая')
col = bmw.get_color()
print(col)  # => серебристая
bmw.drive_to('Волгоград')  # => Машина не заведена. Никуда не едем.

#-------------------------------------------------------------------------------------------------
# Инкапсуляция: уровни доступа
# Пример: аккаунт в банке.
class Account:
    def __init__(self, owner, balance):
        self.owner = owner  # публичный атрибут - имя пользователя
        self.__balance = balance  # приватный атрибут - текущий баланс на счёте

    # геттер: метод для доступа к балансу в основной программе
    def get_balance(self):
        return self.__balance


acc = Account("Иван", 1000)
print(acc.owner)  # => Иван
print(acc.__balance)   # => AttributeError
print(acc.get_balance())  # => 1000

#-------------------------------------------------------------------------------------------------
# Ссылка на задачи: https://github.com/alekseewatatianawork73/Python_second_year/blob/main/OOP_tasks.md

#-------------------------------------------------------------------------------------------------
